<a href="https://colab.research.google.com/github/19PA1A0563/python-basics/blob/master/pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
a=pd.Series(['a','b','c'])
print(a)

0    a
1    b
2    c
dtype: object

In [0]:
import pandas as pd
b=pd.Series(['a','b','c','d'],index=[1,2,3,4])
print(b)
print(a[0])
print(a[:3])

1    a
2    b
3    c
4    d
dtype: object
a
0    a
1    b
2    c
dtype: object

In [0]:
import pandas as pd
import numpy as np
df=pd.DataFrame([['c 501','ram',501],['c 502','mani',502],['c 503','sum',503]],columns=['roll n.o','name','age'])
df

  roll n.o  name  age
0    c 501   ram  501
1    c 502  mani  502
2    c 503   sum  503

In [0]:
import pandas as pd
df=pd.DataFrame({"name":["k.surendra","jaya sri","sai charitha","rakshith"],"relation":["father","mother","daughter","son"]})
df

           name  relation
0    k.surendra    father
1      jaya sri    mother
2  sai charitha  daughter
3      rakshith       son

# New Section

# New Section

# New Section